# InvalidNumwiresSinglephase Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..InvalidNumwiresSinglephase Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Invalid number of wires for single phase, only 2 and 3 are valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidNumwiresSinglephase { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidNumwiresSinglephase As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidNumwiresSinglephase {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace